# Python Pandas

In [64]:
import pandas as pd

In [65]:
import numpy as np

## Panda Series

In [66]:
#creating a panda series
letters='abcdefg'

In [67]:
first_series=pd.Series(list(letters))

In [68]:
first_series

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [69]:
#Series from a ndarray
np_country=np.array(['Kenya','Uganda','South Africa','Tanzania','Ghana','Nigeria','Egypt','Algeria'])

In [70]:
Series_country=pd.Series(np_country)

In [71]:
Series_country

0           Kenya
1          Uganda
2    South Africa
3        Tanzania
4           Ghana
5         Nigeria
6           Egypt
7         Algeria
dtype: object

In [72]:
Series_country[0]

'Kenya'

In [73]:
GDP=[234,546,567,890,123,456,567,789]

In [74]:
#series from dict
Series2=pd.Series(GDP,index=[np_country])

In [75]:
Series2

Kenya           234
Uganda          546
South Africa    567
Tanzania        890
Ghana           123
Nigeria         456
Egypt           567
Algeria         789
dtype: int64

In [76]:
#Creating Series from scalar
scalar_series=pd.Series(5.,index=['a','b','d','d','e'])

In [77]:
scalar_series

a    5.0
b    5.0
d    5.0
d    5.0
e    5.0
dtype: float64

pd.Series(data,index)

In [78]:
#accessing
Series_country[0:4]

0           Kenya
1          Uganda
2    South Africa
3        Tanzania
dtype: object

In [79]:
Series2[0:5]

Kenya           234
Uganda          546
South Africa    567
Tanzania        890
Ghana           123
dtype: int64

In [80]:
#accessing values along a row through index name
Series2.loc["Uganda"]

Uganda    546
dtype: int64

In [81]:
#accessing values in a row through their index's index
Series2.iloc[0]

234

looking up through index position.
Basically accessing the rows

#### Vectorized Operations in Series

<p>Vectorized operations show how series can be added. Are performed by the index positions of data elements

In [82]:
Data=[1,2,3,4]
Data2=[10,20,30,40]

In [83]:
first_vector_series=pd.Series(Data,index=['a','b','c','d'])

In [84]:
second_vector_series=pd.Series(Data2,index=['a','b','c','d'])

In [85]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

<p> The data element is bound to the index position. Shuffling shows these results </p>

In [86]:
second_vector_series=pd.Series(Data2,index=['a','d','b','c'])

In [87]:
first_vector_series+second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [88]:
#let's introduce new indices
second_vector_series=pd.Series(Data2,index=['a','b','e','f'])

In [89]:
first_vector_series+second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

<p>Further shows the data elemet boundness to the index. The new second_vector_series lacks c and d and threfore no additions could be made </p>
The additional letters do not match any index in the first series </br>

## Panda DataFrame

In [90]:
import pandas as pd

In [91]:
#Creating a dataframe from dictionary of equal length lists
olympic_data_list={'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                  'Year':[2012,2008,2004,2000,1996],
                  'No. of participating Countries':[205,204,201,200,197]}

In [92]:
df=pd.DataFrame(olympic_data_list)

In [93]:
df

  HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [94]:
#Creating a dataframe from dict of dicts
df1={'London':{2012:205},'Beijing':{2008:204}}

In [95]:
df1=pd.DataFrame(df1)

In [96]:
df1

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [97]:
#viewing dataframes
df.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [98]:
df.describe

<bound method NDFrame.describe of   HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [99]:
#Creating dataframe from dict of series
#lets start by creating some series
Oly1=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
Oly2=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])
#They need to have the same index values

In [100]:
#Dtaframe from the series. Create a dict with the series as values
Dframe={'No. of Countries Participating':Oly1,'Host Cities':Oly2}

In [101]:
df3=pd.DataFrame(Dframe)

In [102]:
df3

      No. of Countries Participating Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [103]:
#creating Dataframe from ndarray
#Create the ndarrays then create a dict with keys(column names) and the ndarrays as values
np_array=np.array([2012,2008,2004,2006])
np_array2=np.array(['Masila','David','Mwendwa','Mailu'])
dict_ndarray={'year':np_array,'Names':np_array2}

In [104]:
df4=pd.DataFrame(dict_ndarray)

In [105]:
df4

   year    Names
0  2012   Masila
1  2008    David
2  2004  Mwendwa
3  2006    Mailu

In [106]:
df4.describe

<bound method NDFrame.describe of    year    Names
0  2012   Masila
1  2008    David
2  2004  Mwendwa
3  2006    Mailu>

In [107]:
df4.Names

0     Masila
1      David
2    Mwendwa
3      Mailu
Name: Names, dtype: object

### Viewing and Selecting data in pandas

#### Viewing data

In [108]:
df

  HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [109]:
df.describe

<bound method NDFrame.describe of   HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [110]:
df.head(2)

  HostCity  Year  No. of participating Countries
0   London  2012                             205
1  Beijing  2008                             204

In [111]:
df.tail(2)

  HostCity  Year  No. of participating Countries
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [112]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [113]:
df.columns

Index(['HostCity', 'Year', 'No. of participating Countries'], dtype='object')

#### Selecting data

In [114]:
df['HostCity']

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [115]:
df['Year']

0    2012
1    2008
2    2004
3    2000
4    1996
Name: Year, dtype: int64

In [119]:
df3

      No. of Countries Participating Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [120]:
df3.loc[2012]

No. of Countries Participating       205
Host Cities                       London
Name: 2012, dtype: object

In [122]:
df3.iloc[0:2]

      No. of Countries Participating Host Cities
2012                             205      London
2008                             204     Beijing

In [126]:
#integer -location based data selection by index value
df3.iat[3,1]#locations the value in row index 3 and column index 1

'Sydney'

In [128]:
#selecting by boolean expression
df3[df3['No. of Countries Participating'] > 200]

      No. of Countries Participating Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens

### Handling missing values

In [129]:
#lest dela with a series
First=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [131]:
Second=pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

In [137]:
SumUp=First+Second

In [138]:
SumUp

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [139]:
New_SumUp=SumUp.dropna()

In [140]:
New_SumUp

c    13.0
e    25.0
dtype: float64

In [141]:
#Fill method - fill with the parameters passed in the fillna method
FillNa=SumUp.fillna(0)

In [142]:
FillNa

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [143]:
#fill values with zeroes before performing addition operation for missing values
FilledWithZerosBeforeSum=First.add(Second,fill_value=0)

In [144]:
FilledWithZerosBeforeSum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operations

In [149]:
dfA=pd.DataFrame({'movie 1':[5,4,3,3,2,1],
                 'movie 2':[4,5,2,3,4,2]},
                 index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [150]:
dfA

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

#### Data Operation with Functions

In [153]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [154]:
movie_grade(5)

'A'

To apply the function we use apply map method.

In [155]:
dfA.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

#### Data opearion with statistical functions

In [156]:
dfB=pd.DataFrame({'Test1':[95,84,73,88,82,61],
                 'Test2':[74,85,82,73,77,79]},
                index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])

In [157]:
dfB

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [158]:
dfB.max()

Test1    95
Test2    85
dtype: int64

In [160]:
dfB.min()

Test1    61
Test2    73
dtype: int64

In [162]:
dfB.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [163]:
dfB.std()

Test1    11.979149
Test2     4.633213
dtype: float64

#### Data operation using Groupby

In [164]:
dfC=pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                 'last':['Bush','Clinton','Regan','Carter','Washington']})

In [165]:
dfC

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [166]:
grouped=dfC.groupby('first')

In [169]:
grp_data=grouped.get_group('George')

In [170]:
grp_data

    first        last
0  George        Bush
4  George  Washington

#### Data operation - sorting

In [174]:
dfC.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

### Data Standardization
Also known as normalization of data <br>
Can be done in several ways <br>
Use dfB created above

In [180]:
dfB

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [175]:
def standardize_tests(test):
    return(test-test.mean())/test.std()

In [181]:
#function check
standardize_tests(dfB['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [183]:
#Applying the fcuntion to the entire data set
#this creates a function that applies the previous function to the entire data set using the apply method.
def standardize_test_scores(dataframe):
    return dataframe.apply(standardize_tests)

In [184]:
standardize_test_scores(dfB)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

### Data opearation - Merge , duplicate and concatenate

In [189]:
dfD=pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                 'ID':[10,56,31,85,9,22]})

In [190]:
dfE=pd.DataFrame({'student':['Tom','Ram','David'],
                 'ID':[10,12,22]})

##### Merge

In [193]:
#merge where the ID is identical and returns just that datagrame
pd.merge(dfD,dfE)

  student  ID
0     Tom  10
1   David  22

In [194]:
#lets decide where to merge it on. It shows the diffrent ID the values have on the their names
pd.merge(dfD,dfE,on="student")

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [195]:
#merge left join on key ID and also fill NaN values with X
#this will include everything in the first data frame and then corresponding IDs on the second dataframe
pd.merge(dfD,dfE,on='ID',how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [197]:
#merge a right join on ID and fill NaN with x
#as shown in the result, this merge method uses the dfE as the main dataframe and evaluates its contents to dfD
pd.merge(dfD,dfE,on='ID',how='right').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1         X  12       Ram
2     David  22     David

##### Concatenation

In [198]:
#concatenation without ingoring index
pd.concat([dfD,dfE])

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
0     Tom  10
1     Ram  12
2   David  22

In [200]:
#doesnt count the dataframe indexes separately
pd.concat([dfD,dfE],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [202]:
#define new dataframe with student survey data
dfF=pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                 'ID':[10,56,10,85,9,56]})

In [203]:
dfF

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [205]:
#check for duplicates
dfF.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [206]:
#droping duplicates with student as key
dfF.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [208]:
#drop duplicates with ID as key
dfF.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [214]:
dfB.head(1)

      Test1  Test2
Jack     95     74